# RevisionNumber Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Revision..::..RevisionNumber Property
Revision Class See Also
---
The Revision number of this revision.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public string RevisionNumber { get; }
```

Visual Basic
---
```text
Public ReadOnly Property RevisionNumber As String
	Get
```

Visual C++
---
```text
public:
property String^ RevisionNumber {
	String^ get ();
}
```

# Remarks
Note that this field is only available if the RevisionSettings are set to number revisions PerProject. When Revisions are numbered PerSheet, a given Revision may display a different RevisionNumber on each sheet. In this case, the revision number can be obtained by calling [!:Autodesk::Revit::DB::ViewSheet::GetRevisionNumberOnSheet()].
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This operation is not valid for when the revision numbering is per sheet. |

# See Also
Revision Class
Autodesk.Revit.DB Namespace